sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
/**
 * author: sascha_lammers@gmx.de
 */

#include <Arduino_compat.h>
#include <kfc_fw_config.h>
#include <kfc_fw_config_plugin.h>
#include <stl_ext/array.h>
#include <sys/time.h>
#include <ReadADC.h>
#include <PrintString.h>
#include <HardwareSerial.h>
#include <EventScheduler.h>
#include <BitsToStr.h>
#include <session.h>
#include <misc.h>
#include "blink_led_timer.h"
#include "fs_mapping.h"
#include "WebUISocket.h"
#include "web_server.h"
#include "build.h"
#include "save_crash.h"
#include <JsonBaseReader.h>
#include <Form/Types.h>
#if __LED_BUILTIN_WS2812_NUM_LEDS
#    include <NeoPixelEx.h>
#endif
#include "deep_sleep.h"
#include "PinMonitor.h"
#include "../src/plugins/plugins.h"
#if IOT_SWITCH
#    include "../src/plugins/switch/switch.h"
#endif
#if IOT_WEATHER_STATION
#    include "../src/plugins/weather_station/weather_station.h"
#endif

#if defined(ESP8266)
#    include <core_esp8266_version.h>
#    include <sntp.h>
// #    include <sntp-lwip2.h>
#elif defined(ESP32)
#    include <lwip/apps/sntp.h>
#    include <nvs.h>
#endif

#if RTC_SUPPORT
#    include <RTClib.h>
#    if RTC_DEVICE_DS3231
        RTC_DS3231 rtc;
#    else
#        error RTC device not set
#    endif
#endif

#if DEBUG_KFC_CONFIG
#    include <debug_helper_enable.h>
#else
#    include <debug_helper_disable.h>
#endif

bool KFCFWConfiguration::_initTwoWire = false;
KFCFWConfiguration config;

using MainConfig = KFCConfigurationClasses::MainConfig;
using Network = KFCConfigurationClasses::Network;
using System = KFCConfigurationClasses::System;
using Plugins = KFCConfigurationClasses::PluginsType;

#if HAVE_IMPERIAL_MARCH

// source
// https://sourceforge.net/p/reprap/code/HEAD/tree/trunk/users/metalab/python/imperial_gcode.py

const uint8_t imperial_march_notes[IMPERIAL_MARCH_NOTES_COUNT] PROGMEM = {
    12, 12, 12, 8,  15, 12, 8,  15, 12,         // 9
    19, 19, 19, 20, 15, 12, 8,  15, 12,         // 9
    24, 12, 12, 24, 23, 22, 21, 20, 21,         // 9
    13, 18, 17, 16, 15, 14, 15,                 // 7
    8,  11, 8,  11, 15, 12, 15, 19,             // 8
    24, 12, 12, 24, 23, 22, 21, 20, 21,         // 9
    13, 18, 17, 16, 15, 14, 15,                 // 7
    8,  11, 8,  15, 12, 8,  15, 12              // 8
};

const uint8_t imperial_march_lengths[IMPERIAL_MARCH_NOTES_COUNT] PROGMEM = {
    4, 4, 4, 3, 1, 4, 3, 1, 8,
    4, 4, 4, 3, 1, 4, 3, 1, 8,
    4, 3, 1, 4, 3, 1, 1, 1, 4,
    2, 4, 3, 1, 1, 1, 4,
    2, 4, 3, 1, 4, 3, 1, 8,
    4, 3, 1, 4, 3, 1, 1, 1, 4,
    2, 4, 3, 1, 1, 1, 4,
    2, 4, 3, 1, 4, 3, 1, 8
};

// scripts/tools/gen_note_to_freq.py
const uint16_t note_to_frequency[NOTE_TO_FREQUENCY_COUNT] PROGMEM = {
    // fixed point * 32, index, frequency, fixed point >> 5
    2093, // [0] 65.406 65
    2217, // [1] 69.296 69
    2349, // [2] 73.416 73
    2489, // [3] 77.782 77
    2637, // [4] 82.407 82
    2793, // [5] 87.307 87
    2959, // [6] 92.499 92
    3135, // [7] 97.999 97
    3322, // [8] 103.826 103
    3520, // [9] 110.000 110
    3729, // [10] 116.541 116
    3951, // [11] 123.471 123
    4186, // [12] 130.813 130
    4434, // [13] 138.591 138
    4698, // [14] 146.832 146
    4978, // [15] 155.563 155
    5274, // [16] 164.814 164
    5587, // [17] 174.614 174
    5919, // [18] 184.997 184
    6271, // [19] 195.998 195
    6644, // [20] 207.652 207
    7040, // [21] 220.000 220
    7458, // [22] 233.082 233
    7902, // [23] 246.942 246
    8372, // [24] 261.626 261
    8869, // [25] 277.183 277
    9397, // [26] 293.665 293
    9956, // [27] 311.127 311
    10548, // [28] 329.628 329
    11175, // [29] 349.228 349
    11839, // [30] 369.994 369
    12543, // [31] 391.995 391
    13289, // [32] 415.305 415
    14080, // [33] 440.000 440
    14917, // [34] 466.164 466
    15804, // [35] 493.883 493
    16744, // [36] 523.251 523
    17739, // [37] 554.365 554
    18794, // [38] 587.330 587
    19912, // [39] 622.254 622
    21096, // [40] 659.255 659
    22350, // [41] 698.456 698
    23679, // [42] 739.989 739
    25087, // [43] 783.991 783
    26579, // [44] 830.609 830
    28160, // [45] 880.000 880
    29834, // [46] 932.328 932
    31608, // [47] 987.767 987
    33488, // [48] 1046.502 1046
    35479, // [49] 1108.731 1108
    37589, // [50] 1174.659 1174
    39824, // [51] 1244.508 1244
    42192, // [52] 1318.510 1318
    44701, // [53] 1396.913 1396
    47359, // [54] 1479.978 1479
    50175, // [55] 1567.982 1567
};
#endif

// KFCFWConfiguration

static_assert(CONFIG_EEPROM_SIZE >= 1024 && (CONFIG_EEPROM_SIZE) <= 4096, "invalid EEPROM size");

KFCFWConfiguration::KFCFWConfiguration() :
    Configuration(CONFIG_EEPROM_SIZE),
    _wifiConnected(0),
    _wifiUp(0),
    _wifiFirstConnectionTime(0),
    _garbageCollectionCycleDelay(5000),
    _wifiNumActive(0),
    _wifiErrorCount(0),
    _dirty(false),
    _safeMode(false)
{
    _setupWiFiCallbacks();
}

KFCFWConfiguration::~KFCFWConfiguration()
{
    LoopFunctions::remove(KFCFWConfiguration::loop);
}

void KFCFWConfiguration::_onWiFiConnectCb(const WiFiEventStationModeConnected &event)
{
    __LDBG_printf("ssid=%s channel=%u bssid=%s wifi_connected=%u is_connected=%u ip=%u/%s", event.ssid.c_str(), event.channel, mac2String(event.bssid).c_str(), _wifiConnected, WiFi.isConnected(), IPAddress_isValid(WiFi.localIP()), WiFi.localIP().toString().c_str());
    if (!_wifiConnected) {

        _wifiConnected = millis_not_zero();
        String append;
        if (_wifiFirstConnectionTime == 0) {
            _wifiFirstConnectionTime = _wifiConnected;
            append = PrintString(F(" after %ums"), _wifiConnected);
        }
        Logger_notice(F("WiFi(#%u) connected to %s (%s)%s"), config.getWiFiConfigurationNum() + 1, event.ssid.c_str(), mac2String(event.bssid).c_str(), append.c_str());

        #if ENABLE_DEEP_SLEEP
            config.storeQuickConnect(event.bssid, event.channel);

            // get default WiFi settings
            struct station_config defaultCfg;
            wifi_station_get_config_default(&defaultCfg);

            struct station_config config = {};
            strncpy(reinterpret_cast<char *>(config.ssid), event.ssid.c_str(), sizeof(config.ssid));
            strncpy(reinterpret_cast<char *>(config.password), Network::WiFi::getPassword(_wifiNumActive), sizeof(config.password));
            memmove(config.bssid, event.bssid, sizeof(event.bssid));
            config.bssid_set = *config.bssid != 0;

        #endif

        // #if defined(ESP32)
        //     auto hostname = System::Device::getName();
        //     __LDBG_printf("WiFi.setHostname(%s)", hostname);
        //     if (!WiFi.setHostname(hostname)) {
        //         __LDBG_printf("WiFi.setHostname(%s) failed", hostname);
        //     }
        // #endif

