sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
const __FlashStringHelper *KFCFWConfiguration::getFirmwareVersion()
{
    #if ESP32
        // return getShortFirmwareVersion() + F("-" ARDUINO_ESP32_RELEASE " " ) + FPSTR(__compile_date__);
        return F(FIRMWARE_SHORT_VERSION "-" ARDUINO_ESP32_RELEASE " " __DATE__ " " __TIME__);
    #elif ESP8266
        // return getShortFirmwareVersion() + PrintString(F("-" ARDUINO_ESP8266_RELEASE " "), ARDUINO_ESP8266_GIT_VER) + FPSTR(__compile_date__);
        return ARRAY_F(stdex::array_concat(
                stdex::str_to_array(FIRMWARE_SHORT_VERSION "-"),
                stdex::int_to_array<int, ARDUINO_ESP8266_MAJOR>(), stdex::char_to_array<'.'>(), stdex::int_to_array<int, ARDUINO_ESP8266_MINOR>(), stdex::char_to_array<'.'>(), stdex::int_to_array<int, ARDUINO_ESP8266_REVISION>(),
                stdex::str_to_array("-g"), stdex::hex_to_array<ARDUINO_ESP8266_GIT_VER>(), stdex::str_to_array(FIRMWARE_DEV_SUFFIX),
                stdex::str_to_array(" " __DATE__ " " __TIME__)
        ));
    #else
        // return getShortFirmwareVersion() + ' ' + FPSTR(__compile_date__);
        return F(FIRMWARE_SHORT_VERSION FIRMWARE_DEV_SUFFIX " " __DATE__ " " __TIME__);
    #endif
}

const __FlashStringHelper *KFCFWConfiguration::getShortFirmwareVersion()
{
    return F(FIRMWARE_SHORT_VERSION);
}

#if ENABLE_DEEP_SLEEP

    void KFCFWConfiguration::storeQuickConnect(const uint8_t *bssid, int8_t channel)
    {
        __LDBG_printf("bssid=%s channel=%d", mac2String(bssid).c_str(), channel);

        using namespace DeepSleep;

        WiFiQuickConnect quickConnect;
        if (!RTCMemoryManager::read(RTCMemoryManager::RTCMemoryId::QUICK_CONNECT, &quickConnect, sizeof(quickConnect))) {
            quickConnect = WiFiQuickConnect();
        }
        quickConnect.channel = channel;
        quickConnect.bssid = bssid;
        RTCMemoryManager::write(RTCMemoryManager::RTCMemoryId::QUICK_CONNECT, &quickConnect, sizeof(quickConnect));
    }

    void KFCFWConfiguration::storeStationConfig(uint32_t ip, uint32_t netmask, uint32_t gateway)
    {
        __LDBG_printf("ip=%s(%s) netmask=%s gw=%s bssid=%s",
            IPAddress(ip).toString().c_str(),
            WiFi.localIP().toString().c_str(),
            IPAddress(netmask).toString().c_str(),
            IPAddress(gateway).toString().c_str(),
            WiFi.BSSIDstr().c_str()
        );

        using namespace DeepSleep;

        auto quickConnect = WiFiQuickConnect();
        if (RTCMemoryManager::read(RTCMemoryManager::RTCMemoryId::QUICK_CONNECT, &quickConnect, sizeof(quickConnect))) {
            auto tmp = quickConnect;
            quickConnect.local_ip = ip;
            quickConnect.subnet = netmask;
            quickConnect.gateway = gateway;
            quickConnect.dns1 = WiFi.dnsIP();
            quickConnect.dns2 = WiFi.dnsIP(1);
            quickConnect.bssid = WiFi.BSSID();
            auto flags = System::Flags::getConfig();
            quickConnect.use_static_ip = flags.use_static_ip_during_wakeup;
            RTCMemoryManager::write(RTCMemoryManager::RTCMemoryId::QUICK_CONNECT, &quickConnect, sizeof(quickConnect));

            #if ENABLE_DEEP_SLEEP
                // check for changes before storing in EEPROM
                if (memcmp(&tmp, &quickConnect, sizeof(tmp)) != 0) {
                    __LDBG_printf("update persistent config BSSID=%s ip=%s", mac2String(quickConnect.bssid).c_str(), IPAddress(ip).toString().c_str());
                    struct station_config config;
                    wifi_station_get_config(&config);
                    wifi_station_set_config(&config);
                }
            #endif
        }
        else {
            __DBG_print("reading RTC memory failed");
        }
    }

#endif

void KFCFWConfiguration::setup()
{
    #if ENABLE_DEEP_SLEEP
        if (!resetDetector.hasWakeUpDetected())
    #endif
    {
        Logger_notice(F("Starting KFCFW %s"), (PGM_P)KFCFWConfiguration::getFirmwareVersion());
        #if IOT_WEATHER_STATION_WS2812_NUM
            WeatherStationPlugin::_getInstance()._rainbowStatusLED();
        #else
            BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::FLICKER);
        #endif
    }

    LOOP_FUNCTION_ADD(KFCFWConfiguration::loop);
}

#include "build.h"

// save_crash.h
SaveCrash::Data::FirmwareVersion::FirmwareVersion() :
    major(FIRMWARE_VERSION_MAJOR),
    minor(FIRMWARE_VERSION_MINOR),
    revision(FIRMWARE_VERSION_REVISION),
    build(__BUILD_NUMBER_INT)
{
}

String SaveCrash::Data::FirmwareVersion::toString(const __FlashStringHelper *buildSep) const
{
    return PrintString(F("%u.%u.%u%s%u"), major, minor, revision, buildSep, build);
}

void SaveCrash::Data::FirmwareVersion::printTo(Print &output, const __FlashStringHelper *buildSep) const
{
    output.printf_P(PSTR("%u.%u.%u%s%u"), major, minor, revision, buildSep, build);
}


void KFCFWConfiguration::read(bool wakeup)
{
    if (!Configuration::read()) {
        Logger_error(F("Failed to read configuration, restoring factory settings"));
        config.restoreFactorySettings();
        Configuration::write();
    }
    else if (wakeup == false) {
        auto version = System::Device::getConfig().config_version;
        auto currentVersion = SaveCrash::Data::FirmwareVersion().__version;
        // uint32_t currentVersion = (FIRMWARE_VERSION << 16) | (__BUILD_NUMBER_INT & 0xffff);
        if (currentVersion != version) {

            // auto build = static_cast<uint16_t>(version);
            // version >>= 16;
            // Logger_warning(F("Upgrading EEPROM settings from %d.%d.%d.%u to " FIRMWARE_VERSION_STR "." __BUILD_NUMBER), (version >> 11) & 0x1f, (version >> 6) & 0x1f, (version & 0x3f), build);
            Logger_warning(F("Upgrading EEPROM settings from %s to " FIRMWARE_VERSION_STR "." __BUILD_NUMBER), SaveCrash::Data::FirmwareVersion(version).toString(F(".")).c_str());
            System::Device::getWriteableConfig().config_version = currentVersion;
            config.recoveryMode(false);
            Configuration::write();
            // SaveCrash::clearStorage(SaveCrash::ClearStorageType::REMOVE_MAGIC);
        }
    }
}

void KFCFWConfiguration::write()
{
    auto result = Configuration::write();
    if (result != Configuration::WriteResultType::SUCCESS) {
        Logger_error(F("Failed to write settings to EEPROM. %s"), Configuration::getWriteResultTypeStr(result));
    }
}

#if defined(HAVE_NVS_FLASH)

