sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
    void KFCFWConfiguration::formatNVS()
    {
        #ifdef SECTION_NVS2_START_ADDRESS
            nvs_flash_deinit_partition("nvs2");
            nvs_flash_erase_partition("nvs2");
        #else
            nvs_flash_deinit();
            nvs_flash_erase();
        #endif
    }

#endif

#if ESP8266

    const __FlashStringHelper *KFCFWConfiguration::getSleepTypeStr(sleep_type_t type)
    {
        switch(type) {
            case sleep_type_t::NONE_SLEEP_T:
                return F("None");
            case sleep_type_t::LIGHT_SLEEP_T:
                return F("Light");
            case sleep_type_t::MODEM_SLEEP_T:
                return F("Modem");
            default:
                break;
        }
        return F("Unknown");
    }

    const __FlashStringHelper *KFCFWConfiguration::getWiFiOpModeStr(uint8_t mode)
    {
        switch(mode) {
            case WiFiMode_t::WIFI_STA:
                return F("Station mode");
            case WiFiMode_t::WIFI_AP:
                return F("AP mode");
            case WiFiMode_t::WIFI_AP_STA:
                return F("AP and station mode");
            case WiFiMode_t::WIFI_OFF:
                return F("Off");
            default:
                break;
        }
        return F("Unknown");
    }

    const __FlashStringHelper *KFCFWConfiguration::getWiFiPhyModeStr(phy_mode_t mode)
    {
        switch(mode) {
            case phy_mode_t::PHY_MODE_11B:
                return F("802.11b");
            case phy_mode_t::PHY_MODE_11G:
                return F("802.11g");
            case phy_mode_t::PHY_MODE_11N:
                return F("802.11n");
            default:
                break;
        }
        return F("");
    }

#endif

void KFCFWConfiguration::printDiag(Print &output, const String &prefix)
{
    #if 1
        output.printf_P(PSTR("WiFi uptime %u\n"), uint32_t(config.getWiFiUp() / 1000));
        WiFi.printDiag(output);
        #if ESP32
            output.print(F("IP/IPv6 "));
            WiFi.localIP().printTo(output);
            output.print('/');
            WiFi.localIPv6().printTo(output);
            output.println();
        #endif
    #elif ESP8266
        station_config wifiConfig;
        wifi_station_get_config_default(&wifiConfig);
        output.print(prefix);
        output.printf_P(PSTR("default cfg ssid=%.32s password=%.64s bssid_set=%u bssid=%s mode=%s\n"), wifiConfig.ssid, wifiConfig.password, wifiConfig.bssid_set, mac2String(wifiConfig.bssid).c_str(), KFCFWConfiguration::getWiFiOpModeStr(wifi_get_opmode_default()));
        wifi_station_get_config(&wifiConfig);
        output.print(prefix);
        output.printf_P(PSTR("config ssid=%.32s password=%.64s bssid_set=%u bssid=%s mode=%s\n"), wifiConfig.ssid, wifiConfig.password, wifiConfig.bssid_set, mac2String(wifiConfig.bssid).c_str(), KFCFWConfiguration::getWiFiOpModeStr(wifi_get_opmode()));
        output.print(prefix);
        output.printf_P(PSTR("sleep=%s phy=%s channel=%u AP_id=%u auto_connect=%u reconnect=%u persistent=%u\n"), KFCFWConfiguration::getSleepTypeStr(wifi_get_sleep_type()), KFCFWConfiguration::getWiFiPhyModeStr(wifi_get_phy_mode()), wifi_get_channel(), wifi_station_get_current_ap_id(), wifi_station_get_auto_connect(), wifi_station_get_reconnect_policy(), WiFi.getPersistent());

        auto lastError = config.getLastErrorStr();
        if (lastError.length()) {
            output.print(prefix);
            output.printf_P(PSTR("last_error=%s\n"), lastError.c_str());
        }

        if ((WiFi.getMode() & WiFiMode_t::WIFI_STA)) {
            if (WiFi.isConnected()) {
                output.print(prefix);
                output.printf_P(PSTR("station_ip=%s gw=%s dns=%s, %s bssid=%s\n"), WiFi.localIP().toString().c_str(), WiFi.gatewayIP().toString().c_str(), WiFi.dnsIP(0).toString().c_str(), WiFi.dnsIP(1).toString().c_str(), WiFi.BSSIDstr().c_str());
            }
            else {
                output.print(prefix);
                output.println(F("station not connected"));
            }
        }

        if ((WiFi.getMode() & WiFiMode_t::WIFI_AP)) {
            output.print(prefix);
            output.printf_P(PSTR("softap_ip=%s ssid=%s clients=%u\n"), WiFi.softAPIP().toString().c_str(), WiFi.softAPSSID().c_str(), WiFi.softAPgetStationNum());
        }
    #elif ESP32
        WiFi.printDiag(output);
    #endif
}

bool KFCFWConfiguration::resolveZeroConf(const String &name, const String &hostname, uint16_t port, MDNSResolver::ResolvedCallback callback) const
{
    __LDBG_printf("resolveZeroConf=%s port=%u", hostname.c_str(), port);
    String prefix, suffix;
    auto start = hostname.indexOf(FSPGM(_var_zeroconf));
    if (start != -1) {
        start += 11;
        auto end = hostname.indexOf('}', start);
        if (end != -1) {
            auto serviceEnd = hostname.indexOf('.');
            auto protoEnd = hostname.indexOf(',');
            auto valuesEnd = hostname.indexOf('|');
            __LDBG_printf("start=%d end=%d service_end=%d proto_end=%d name_end=%d", start, end, serviceEnd, protoEnd, valuesEnd);
            if (serviceEnd != -1 && protoEnd != -1 && serviceEnd < protoEnd && (valuesEnd == -1 || protoEnd < valuesEnd)) {
                auto service = hostname.substring(start, serviceEnd);
                auto proto = hostname.substring(serviceEnd + 1, protoEnd);
                prefix = hostname.substring(0, start - 11);
                suffix = hostname.substring(end + 1);
                String addressValue;
                String portValue;
                String defaultValue;
                int portPos;
                if (valuesEnd == -1) {
                    addressValue = hostname.substring(protoEnd + 1, end);
                }
                else {
                    addressValue = hostname.substring(protoEnd + 1, valuesEnd);
                    defaultValue = hostname.substring(valuesEnd + 1, end);
                    if ((portPos = defaultValue.indexOf(':')) != -1) {
                        port = defaultValue.substring(portPos + 1).toInt();
                        defaultValue.remove(portPos);
                    }
                }
                if ((portPos = addressValue.indexOf(':')) != -1) {
                    portValue = addressValue.substring(portPos + 1);
                    addressValue.remove(portPos);
                }
                else {
                    portValue = FSPGM(port);
                }
                if (service.charAt(0) != '_') {
                    service = String('_') + service;
                }
                if (proto.charAt(0) != '_') {
                    proto = String('_') + proto;
                }

