sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
                __LDBG_printf("service=%s proto=%s values=%s:%s default=%s port=%d", service.c_str(), proto.c_str(), addressValue.c_str(), portValue.c_str(), defaultValue.c_str(), port);

                auto mdns = PluginComponent::getPlugin<MDNSPlugin>(F("mdns"), true);
                if (!mdns) {
                    Logger_error(F("Cannot resolve Zeroconf, MDNS plugin not loaded: %s"), hostname.c_str());
                    LoopFunctions::callOnce([defaultValue, port, callback]() {
                        callback(defaultValue, IPAddress(), port, defaultValue, MDNSResolver::ResponseType::TIMEOUT);
                    });
                    return true;
                }

                mdns->resolveZeroConf(new MDNSResolver::Query(name, service, proto, addressValue, portValue, defaultValue, port, prefix, suffix, callback, System::Device::getConfig().zeroconf_timeout));
                return true;

            }
        }
    }
    return false;
}

bool KFCFWConfiguration::hasZeroConf(const String &hostname) const
{
    auto pos = hostname.indexOf(FSPGM(_var_zeroconf));
    if (pos != -1) {
        pos = hostname.indexOf('}', pos + 11);
    }
    __LDBG_printf("has_zero_conf=%s result=%d", hostname.c_str(), pos);
    return pos != -1;
}

#if WIFI_QUICK_CONNECT_MANUAL

    void KFCFWConfiguration::wifiQuickConnect()
    {
        __DBG_printf("quick connect");
        #if ENABLE_DEEP_SLEEP

            #if defined(ESP32)
                WiFi.mode(WIFI_STA); // needs to be called to initialize wifi
                wifi_config_t _config;
                wifi_sta_config_t &config = _config.sta;
                if (esp_wifi_get_config(ESP_IF_WIFI_STA, &_config) == ESP_OK) {
            #elif defined(ESP8266)

                WiFi.persistent(false);
                struct station_config config;
                if (wifi_station_get_config_default(&config)) {
            #endif
                    int32_t channel;
                    uint8_t *bssidPtr;
                    DeepSleep::WiFiQuickConnect quickConnect;

                    // WiFi.enableSTA(true);
                    WiFi.mode(WIFI_STA);

                    if (RTCMemoryManager::read(PluginComponent::RTCMemoryId::QUICK_CONNECT, &quickConnect, sizeof(quickConnect))) {
                        channel = quickConnect.channel;
                        bssidPtr = quickConnect.bssid;
                    }
                    else {
                        quickConnect = {};
                        channel = 0;
                        // bssidPtr = nullptr;
                        __DBG_print("error reading quick connect from rtc memory");
                    }

                    if (channel <= 0 || !bssidPtr) {

                        __DBG_printf("Cannot read quick connect from RTC memory, running WiFi.begin(%s, ***) only", config.ssid);
                        if (WiFi.begin(reinterpret_cast<char *>(config.ssid), reinterpret_cast<char *>(config.password)) != WL_DISCONNECTED) {
                            Logger_error(F("Failed to start WiFi"));
                        }

                    }
                    else {

                        if (quickConnect.use_static_ip && quickConnect.local_ip) {
                            __DBG_printf("configuring static ip");
                            WiFi.config(quickConnect.local_ip, quickConnect.gateway, quickConnect.subnet, quickConnect.dns1, quickConnect.dns2);
                        }

                        wl_status_t result;
                        if ((result = WiFi.begin(reinterpret_cast<char *>(config.ssid), reinterpret_cast<char *>(config.password), channel, bssidPtr, true)) != WL_DISCONNECTED) {
                            __DBG_printf("Failed to start WiFi");
                            Logger_error(F("Failed to start WiFi"));
                        }

                        __DBG_printf("WiFi.begin() = %d, ssid %.32s, channel %d, bssid %s, config: static ip %d, %s/%s gateway %s, dns %s, %s",
                            result,
                            config.ssid,
                            channel,
                            mac2String(bssidPtr).c_str(),
                            quickConnect.use_static_ip ? 1 : 0,
                            __S(IPAddress(quickConnect.local_ip)),
                            inet_nto_cstr(quickConnect.gateway),
                            inet_nto_cstr(quickConnect.subnet),
                            inet_nto_cstr(quickConnect.dns1),
                            inet_nto_cstr(quickConnect.dns2)
                        );

                    }

                }
                else {
                    Logger_error(F("Failed to load WiFi configuration"));
                }
        #endif
    }

#endif

#if ENABLE_DEEP_SLEEP

    void KFCFWConfiguration::enterDeepSleep(milliseconds time, RFMode mode, uint16_t delayAfterPrepare)
    {
        __LDBG_printf("time=%d mode=%d delay_prep=%d", time.count(), mode, delayAfterPrepare);

        // WiFiCallbacks::getVector().clear(); // disable WiFi callbacks to speed up shutdown
        // Scheduler.terminate(); // halt scheduler

        //resetDetector.clearCounter();
        // SaveCrash::removeCrashCounter();

        delay(5);

        for(auto plugin: PluginComponents::Register::getPlugins()) {
            plugin->prepareDeepSleep(time.count());
        }
        if (delayAfterPrepare) {
            delay(delayAfterPrepare);
        }
        __LDBG_printf("Entering deep sleep for %u milliseconds, RF mode %d", time.count(), mode);

        #if __LED_BUILTIN == NEOPIXEL_PIN_ID
            BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::OFF);
        #endif

        DeepSleep::DeepSleepParam::enterDeepSleep(time, mode);
    }

#endif

#if IOT_LED_MATRIX_OUTPUT_PIN
    extern "C" void ClockPluginClearPixels();
#endif

static void invoke_ESP_restart()
{
    #if IOT_LED_MATRIX_OUTPUT_PIN
        #ifndef ESP32
            ClockPluginClearPixels();
        #endif
    #endif

    BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::OFF);
    #if BUILTIN_LED_NEOPIXEL
        WS2812LEDTimer::terminate();
    #endif

    __Scheduler.end();
    ETSTimerEx::end();

