sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
    #if IOT_SWITCH && IOT_SWITCH_STORE_STATES_RTC_MEM
        SwitchPlugin::_rtcMemStoreState();
    #endif

    #if RTC_SUPPORT == 0
        RTCMemoryManager::storeTime();
    #endif

    ESP.restart();
}

#if PIN_MONITOR
#    include "pin_monitor.h"
#endif

void KFCFWConfiguration::resetDevice(bool safeMode)
{
    String msg = F("Device is being reset");
    if (safeMode) {
        msg += F(" in SAFE MODE");
    }
    Logger_notice(msg);
    delay(500);

    #if LOGGER
        _logger.end();
    #endif

    SaveCrash::removeCrashCounterAndSafeMode();
    resetDetector.setSafeMode(safeMode);
    #if ENABLE_DEEP_SLEEP
        DeepSleep::DeepSleepParam::reset();
    #endif
    invoke_ESP_restart();
}

// enable debugging output (::printf) for shutdown sequence
#define DEBUG_SHUTDOWN_SEQUENCE DEBUG
#if DEBUG_SHUTDOWN_SEQUENCE
#    define _DPRINTF(msg, ...) ::printf(PSTR(msg "\n"), ##__VA_ARGS__)
#else
#    define _DPRINTF(...)
#endif

extern bool is_at_mode_enabled;

void KFCFWConfiguration::restartDevice(bool safeMode)
{
    __LDBG_println();
    is_at_mode_enabled = false;

    String msg = F("Device is being restarted");
    if (safeMode) {
        msg += F(" in SAFE MODE");
    }
    Logger_notice(msg);
    BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::FLICKER);

    delay(500);
    #if LOGGER
        _logger.end();
    #endif

    SaveCrash::removeCrashCounterAndSafeMode();
    resetDetector.setSafeMode(safeMode);
    #if ENABLE_DEEP_SLEEP
        DeepSleep::DeepSleepParam::reset();
    #endif
    if (_safeMode) {
        #if DEBUG_SHUTDOWN_SEQUENCE
            _DPRINTF("safe mode: invoking restart");
        #endif
        invoke_ESP_restart();
    }

    // clear queue silently
    ADCManager::terminate(false);

    #if HTTP2SERIAL_SUPPORT
        _DPRINTF("terminating http2serial instance");
        Http2Serial::destroyInstance();
    #endif

    _DPRINTF("scheduled tasks %u, WiFi callbacks %u, Loop Functions %u", _Scheduler.size(), WiFiCallbacks::getVector().size(), LoopFunctions::size());

    auto webUiSocket = WebUISocket::getServerSocket();
    if (webUiSocket) {
        _DPRINTF("terminating webui websocket=%p", webUiSocket);
        webUiSocket->shutdown();
    }

    // execute in reverse order
    auto &plugins = PluginComponents::RegisterEx::getPlugins();
    for(auto iterator = plugins.rbegin(); iterator != plugins.rend(); ++iterator) {
        const auto plugin = *iterator;
        _DPRINTF("shutdown plugin=%s", plugin->getName_P());
        plugin->shutdown();
        plugin->clearSetupTime();
    }

    _DPRINTF("scheduled tasks %u, WiFi callbacks %u, Loop Functions %u", _Scheduler.size(), WiFiCallbacks::getVector().size(), LoopFunctions::size());

    #if PIN_MONITOR
        _DPRINTF("terminating pin monitor");
        PinMonitor::pinMonitor.end();
    #endif

    _DPRINTF("terminating serial handlers");
    serialHandler.end();
    #if DEBUG
        debugStreamWrapper.clear();
    #endif

    #if DEBUG_SHUTDOWN_SEQUENCE
        _DPRINTF("clearing wifi callbacks");
    #endif
    WiFiCallbacks::clear();

    #if DEBUG_SHUTDOWN_SEQUENCE
        _DPRINTF("clearing loop functions");
    #endif
    LoopFunctions::clear();

    #if DEBUG_SHUTDOWN_SEQUENCE
        _DPRINTF("invoking restart");
    #endif
    invoke_ESP_restart();
}

void KFCFWConfiguration::loop()
{
    config.gc();
}

uint8_t KFCFWConfiguration::getMaxWiFiChannels()
{
    wifi_country_t country;
    if (!wifi_get_country(&country)) {
        country.nchan = 255;
    }
    return country.nchan;
}

const __FlashStringHelper *KFCFWConfiguration::getWiFiEncryptionType(uint8_t type)
{
    #if defined(ESP32)
        switch(type) {
            case WIFI_AUTH_OPEN:
                return F("open");
            case WIFI_AUTH_WEP:
                return F("WEP");
            case WIFI_AUTH_WPA_PSK:
                return F("WPA/PSK");
            case WIFI_AUTH_WPA2_PSK:
                return F("WPA2/PSK");
            case WIFI_AUTH_WPA_WPA2_PSK:
                return F("WPA/WPA2/PSK");
            case WIFI_AUTH_WPA2_ENTERPRISE:
                return F("WPA2/ENTERPRISE");
        }
    #elif defined(ESP8266)
        switch(type) {
            case ENC_TYPE_NONE:
                return F("open");
            case ENC_TYPE_WEP:
                return F("WEP");
            case ENC_TYPE_TKIP:
                return F("WPA/PSK");
            case ENC_TYPE_CCMP:
                return F("WPA2/PSK");
            case ENC_TYPE_AUTO:
                return F("auto");
        }
    #endif
    return F("N/A");
}

bool KFCFWConfiguration::reconfigureWiFi(const __FlashStringHelper *msg, uint8_t configNum)
{
    __LDBG_printf("re-config=%u", configNum);
    if (msg) {
        Logger_notice(msg);
        #if DEBUG_KFC_CONFIG
            __DBG_printf("WiFi diagnostics");
            WiFi.printDiag(DEBUG_OUTPUT);
        #endif
    }
    WiFi.persistent(false); // disable storing WiFi config
    WiFi.setAutoConnect(false);
    WiFi.setAutoReconnect(false);
    WiFi.disconnect(true);
    WiFi.softAPdisconnect(true);

    return connectWiFi(configNum);
}

bool KFCFWConfiguration::connectWiFi(uint8_t configNum, bool ignoreSoftAP)
{
    __LDBG_printf("config=%u ign_softap=%u", configNum, ignoreSoftAP);
    setLastError(String());
    if (configNum != kKeepWiFiNetwork) {
        // set new wifi network
        setWiFiConfigurationNum(configNum);
    }

    bool station_mode_success = false;
    bool ap_mode_success = false;

    #if ESP32
        auto hostname = System::Device::getName();
        WiFi.setHostname(hostname);
        WiFi.softAPsetHostname(hostname);
    #endif

    auto flags = System::Flags::getConfig();
    if (flags.is_station_mode_enabled) {
        __LDBG_printf("init station mode");
        WiFi.setAutoConnect(false); // WiFi callbacks have to be installed first during boot
        WiFi.setAutoReconnect(true);
        WiFi.enableSTA(true);

        // wifi connection result
        bool result;
        // scan for WiFi networks to get the signal strength
        auto wifiId = scanWifiStrength(getWiFiConfigurationId());
        // get wifi config for the selected network
        size_t wifiIndex;
        auto network = Network::WiFi::getNetworkConfigOrdered(wifiId, wifiIndex);
        if (network.isDHCPEnabled()) {
            result = WiFi.config(0U, 0U, 0U, 0U, 0U);
        }
        else {
            result = WiFi.config(network.getLocalIp(), network.getGateway(), network.getSubnet(), network.getDns1(), network.getDns2());
        }
        if (!result) {
            setLastError(PrintString(F("Failed to configure Station Mode with %s"), network.isDHCPEnabled() ? PSTR("DHCP") : PSTR("static address")));
            Logger_error(F("%s"), getLastError());
        }
        else {
            if (WiFi.begin(Network::WiFi::getSSID(wifiIndex), Network::WiFi::getPassword(wifiIndex)) == WL_CONNECT_FAILED) {
                setLastError(F("Failed to start Station Mode"));
                Logger_error(F("%s"), getLastError());
            }
            else {
                __LDBG_printf("Station Mode SSID %s", Network::WiFi::getSSID(wifiIndex));
                station_mode_success = true;
            }
        }
    }
    else {
        __LDBG_printf("disabling station mode");
        WiFi.disconnect(true);
        WiFi.enableSTA(false);
        station_mode_success = true;
    }

    if (!ignoreSoftAP) {

        if (flags.is_softap_enabled) {
            __LDBG_printf("init AP mode");

            WiFi.enableAP(true);

            auto softAp = Network::SoftAP::getConfig();
            if (!WiFi.softAPConfig(softAp.getAddress(), softAp.getGateway(), softAp.getSubnet())) {
                setLastError(F("Cannot configure AP mode"));
                Logger_error(F("%s"), getLastError());
            }
            else {
                #if defined(ESP32)

