sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
                    if (tcpip_adapter_dhcps_stop(TCPIP_ADAPTER_IF_AP) != ESP_OK) {
                        __LDBG_printf("tcpip_adapter_dhcps_stop(TCPIP_ADAPTER_IF_AP) failed");
                    }

                    dhcps_lease_t lease;
                    lease.enable = flags.is_softap_dhcpd_enabled;
                    lease.start_ip.addr = softAp.dhcp_start;
                    lease.end_ip.addr = softAp.dhcp_end;

                    if (tcpip_adapter_dhcps_option(TCPIP_ADAPTER_OP_SET, TCPIP_ADAPTER_REQUESTED_IP_ADDRESS, &lease, sizeof(lease)) != ESP_OK) {
                        setLastError(F("Failed to configure DHCP server"));
                        Logger_error(F("%s"), getLastError());
                    }
                    else if (flags.is_softap_dhcpd_enabled && tcpip_adapter_dhcps_start(TCPIP_ADAPTER_IF_AP) != ESP_OK) {
                        setLastError(F("Failed to start DHCP server"));
                        Logger_error(F("%s"), getLastError());
                    }

                #elif defined(ESP8266)

                    // setup after WiFi.softAPConfig()
                    struct dhcps_lease dhcp_lease;
                    wifi_softap_dhcps_stop();
                    dhcp_lease.enable = flags.is_softap_dhcpd_enabled;
                    dhcp_lease.start_ip.addr = softAp.dhcp_start;
                    dhcp_lease.end_ip.addr = softAp.dhcp_end;
                    if (!wifi_softap_set_dhcps_lease(&dhcp_lease)) {
                        setLastError(F("Failed to configure DHCP server"));
                        Logger_error(F("%s"), getLastError());
                    }
                    else if (flags.is_softap_dhcpd_enabled && !wifi_softap_dhcps_start()) {
                        setLastError(F("Failed to start DHCP server"));
                        Logger_error(F("%s"), getLastError());
                    }

                #endif

                __LDBG_printf("ap ssid=%s pass=%s channel=%u hidden=%u", Network::WiFi::getSoftApSSID(), Network::WiFi::getSoftApPassword(), softAp.getChannel(), flags.is_softap_ssid_hidden);

                if (!WiFi.softAP(Network::WiFi::getSoftApSSID(), Network::WiFi::getSoftApPassword(), softAp.getChannel(), flags.is_softap_ssid_hidden)) {
                    setLastError(F("Cannot start AP mode"));
                    Logger_error(F("%s"), getLastError());
                }
                else {
                    Logger_notice(F("AP Mode successfully initialized"));
                    ap_mode_success = true;

                    #if ENABLE_ARDUINO_OTA && !ENABLE_ARDUINO_OTA_AUTOSTART
                        if (flags.is_softap_standby_mode_enabled) {
                            auto &plugin = WebServer::Plugin::getInstance();
                            plugin.ArduinoOTAbegin();
                        }
                    #endif
                }
            }
        }
        else {
            __LDBG_print("disabling AP mode");
            WiFi.softAPdisconnect(true);
            WiFi.enableAP(false);
            ap_mode_success = true;
        }

        // install handler to enable AP mode if station mode goes down
        if (flags.is_softap_standby_mode_enabled) {
            WiFiCallbacks::add(WiFiCallbacks::EventType::CONNECTION, KFCFWConfiguration::apStandbyModeHandler);
        }
        else {
            WiFiCallbacks::remove(WiFiCallbacks::EventType::ANY, KFCFWConfiguration::apStandbyModeHandler);
        }

    }
    else {
        __LDBG_printf("skipping soft AP config: IP %s", WiFi.softAPIP().toString().c_str());
    }

    #if __LED_BUILTIN != IGNORE_BUILTIN_LED_PIN_ID || ENABLE_BOOT_LOG
        if (!station_mode_success || !ap_mode_success) {
            #if !IOT_WEATHER_STATION_WS2812_NUM
                BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::FAST);
            #endif
        }
    #endif

    #if ESP8266
        auto hostname = System::Device::getName();
        WiFi.hostname(hostname);
    #endif

    return (station_mode_success && ap_mode_success);
}

const __FlashStringHelper *KFCFWConfiguration::getChipModel()
{
    #if ESP8265
        return F("ESP8265");
    #elif ESP8266
        return F("ESP8266");
    #elif ESP32
        #if CONFIG_IDF_TARGET_ESP32
            return F("ESP32");
        #elif CONFIG_IDF_TARGET_ESP32S2
            return F("ESP32-S2");
        #elif CONFIG_IDF_TARGET_ESP32S3
            return F("ESP32-S3");
        #elif CONFIG_IDF_TARGET_ESP32C3
            return F("ESP32-C3");
        #else
            #error unknown device
        #endif
    #else
        #error unknown device
    #endif
}

void KFCFWConfiguration::printVersion(Print &output)
{
    output.print(F("KFC Firmware "));
    output.print(KFCFWConfiguration::getFirmwareVersion());
    output.printf_P(PSTR("\nFlash size %s\n"), formatBytes(ESP.getFlashChipSize()).c_str());
    if (config._safeMode) {
        Logger_notice(FSPGM(safe_mode_enabled, "Device started in SAFE MODE"));
        output.println(FSPGM(safe_mode_enabled));
    }
}

void KFCFWConfiguration::printInfo(Print &output)
{
    printVersion(output);

    auto flags = System::Flags::getConfig();
    if (flags.is_softap_enabled) {
        output.printf_P(PSTR("AP Mode SSID %s\n"), Network::WiFi::getSoftApSSID());
    }
    if (flags.is_station_mode_enabled) {
        output.printf_P(PSTR("Station Mode SSID %s\n"), Network::WiFi::getSSID(_wifiNumActive));
    }
    if (flags.is_factory_settings) {
        output.println(F("Running on factory settings"));
    }
    if (flags.is_default_password) {
        Logger_security(FSPGM(default_password_warning));
        output.println(FSPGM(default_password_warning, "WARNING! Default password has not been changed"));
    }
    output.printf_P(PSTR("Device %s ready!\n"), System::Device::getName());

    #if AT_MODE_SUPPORTED
        if (at_mode_enabled()) {
            output.println(F("Modified AT instruction set available.\n\nType AT? for help"));
        }
    #endif
}

void KFCFWConfiguration::getStatus(Print &output)
{
    #if defined(HAVE_NVS_FLASH)
        auto stats = config.getNVSStats();
        output.printf_P(PSTR("NVS flash storage max. size %uKB, %.1f%% in use" HTML_S(br)), config.getNVSFlashSize() / 1024, (stats.used_entries * 100) / float(stats.total_entries));
        output.printf_P(PSTR("NVS partition memory usage %u byte " HTML_S(br)), config.getNVSInitMemoryUsage());
    #else
        output.printf_P(PSTR("EEPROM storage max. size %uKB" HTML_S(br)), SPI_FLASH_SEC_SIZE / 1024);
    #endif
    output.printf_P(PSTR("Stored items %u, size %.2fKB, version %u" HTML_S(br)), config.getConfigItemNum(), getConfigItemSize() / 1024.0, config.getVersion());
}

