sascha432/esp8266-kfc-fw/src/kfc_fw_config.cpp
uint32_t KFCFWConfiguration::getWiFiUp()
{
    if (!WiFi.isConnected() || !config._wifiUp) {
        return 0;
    }
    return std::max<decltype(config._wifiUp)>(1, get_time_since(config._wifiUp, millis()));
}

#if 0
#    define __DBG_RTC_printf __DBG_printf
#else
#    define __DBG_RTC_printf(...) ;
#endif

#ifndef DISABLE_TWO_WIRE
    TwoWire &KFCFWConfiguration::initTwoWire(bool reset, Print *output)
    {
        if (output) {
            output->printf_P("I2C: SDA=%u, SCL=%u, clock stretch=%u, clock speed=%u, reset=%u\n", KFC_TWOWIRE_SDA, KFC_TWOWIRE_SCL, KFC_TWOWIRE_CLOCK_STRETCH, KFC_TWOWIRE_CLOCK_SPEED, reset);
        }
        if (!_initTwoWire || reset) {
            __DBG_RTC_printf("SDA=%u,SCL=%u,stretch=%u,speed=%u,rst=%u", KFC_TWOWIRE_SDA, KFC_TWOWIRE_SCL, KFC_TWOWIRE_CLOCK_STRETCH, KFC_TWOWIRE_CLOCK_SPEED, reset);
            _initTwoWire = true;
            Wire.begin(KFC_TWOWIRE_SDA, KFC_TWOWIRE_SCL);
            Wire.setClockStretchLimit(KFC_TWOWIRE_CLOCK_STRETCH);
            Wire.setClock(KFC_TWOWIRE_CLOCK_SPEED);
        }
        return Wire;
    }
#endif

void KFCFWConfiguration::setupRTC()
{
    #if RTC_SUPPORT
        // support for external RTCs
        auto status = config.getRTCStatus();
        __DBG_RTC_printf("unixtime=%u", status.time);
        if (status.time != 0) {
            struct timeval tv = { static_cast<time_t>(status.time), 0 };
            settimeofday(&tv, nullptr);
            RTCMemoryManager::setTime(status.time, status.lostPower ? RTCMemoryManager::SyncStatus::NO : RTCMemoryManager::SyncStatus::YES);
        }
        else {
            RTCMemoryManager::setSyncStatus(RTCMemoryManager::SyncStatus::NO);
        }
    #else
        // support for the internal RTC
        // NTP should be used to synchronize the RTC after each restart, if possible after deep sleep as well
        // issues:
        // - inaccurate when using deep sleep
        // - no battery backup
        //
        // after a reset, the time is marked as not synchronized (lostPower == true) until set by NTP or manually
        // while it does not work if a device gets turned off, it is still ok when rebooting or recovering from a
        // crash time() won't start at 1970...
        RTCMemoryManager::setSyncStatus(RTCMemoryManager::SyncStatus::NO);
        auto rtc = RTCMemoryManager::readTime();
        __DBG_RTC_printf("unixtime=%u", rtc.time);
        struct timeval tv = { static_cast<time_t>(rtc.time), 0 };
        settimeofday(&tv, nullptr);
        RTCMemoryManager::setupRTC();
    #endif
}

bool KFCFWConfiguration::setRTC(uint32_t unixtime)
{
    __DBG_RTC_printf("time=%u", unixtime);
    #if RTC_SUPPORT
        initTwoWire();
        if (!rtc.begin()) {
            __DBG_RTC_printf("rtc.begin() failed #1");
            if (!can_yield()) {
                return false;
            }
            delay(5);
            if (!rtc.begin()) {
                __DBG_RTC_printf("rtc.begin() failed #2");
                RTCMemoryManager::setSyncStatus(RTCMemoryManager::SyncStatus::NO);
                return false;
            }
        }
        rtc.adjust(DateTime(unixtime));
    #endif
    RTCMemoryManager::setTime(unixtime, RTCMemoryManager::SyncStatus::YES);
    return true;
}

KFCFWConfiguration::RtcStatus KFCFWConfiguration::getRTCStatus()
{
    RtcStatus status;
    #if RTC_SUPPORT
        initTwoWire();
        if (!rtc.begin()) {
            __DBG_RTC_printf("rtc.begin() failed #1");
            if (!can_yield()) {
                return status;
            }
            delay(5);
            if (!rtc.begin()) {
                __DBG_RTC_printf("rtc.begin() failed #2");
                return status;
            }
        }
        status.time = rtc.now().unixtime();
        status.temperature = rtc.getTemperature();
        status.lostPower = rtc.lostPower();
        if (status.lostPower || !isTimeValid(status.time)) {
            RTCMemoryManager::setSyncStatus(RTCMemoryManager::SyncStatus::NO);
        }
    #else
        status.time = time(nullptr);
        if (!isTimeValid(status.time)) {
            RTCMemoryManager::setSyncStatus(RTCMemoryManager::SyncStatus::NO);
        }
        status.lostPower = RTCMemoryManager::getSyncStatus() != RTCMemoryManager::SyncStatus::YES;
    #endif
    return status;
}

void KFCFWConfiguration::printRTCStatus(Print &output, const RtcStatus &status, bool plain)
{
    __DBG_RTC_printf("temp=%.3f lost_power=%u", status.temperature, status.lostPower);
    PGM_P nl = plain ? PSTR(", ") : PSTR(HTML_S(br));
    output.print(F("Timestamp: "));
    {
        PrintString nowStr;
        nowStr.strftime(FSPGM(strftime_date_time_zone), status.time);
        output.print(nowStr);
    }
    if (!isnan(status.temperature)) {
        output.printf_P(PSTR("%sTemperature: %.2f%s"), nl, status.temperature, plain ? PSTR("C") : SPGM(UTF8_degreeC));
    }
    output.printf_P(PSTR("%sLost Power: %s"), nl, status.lostPower ? SPGM(Yes) : SPGM(No));

    #if RTC_SUPPORT
        if (status.time == 0) {
            output.printf_P(PSTR("%sFailed to initialize RTC"), nl);
        }
    #endif
}

KFCFWConfiguration::StationConfigType KFCFWConfiguration::scanWifiStrength(StationConfigType configNum)
{
    auto stations = getStations();

    // check if there is any station with priority 0 / auto detect strength
    auto iter = std::find_if(stations.begin(), stations.end(), [](const auto &station) {
        return station._SSID.length() && (station._priority == 0);
    });
    if (iter == stations.end()) {
        __LDBG_printf("no stations in auto mode");
        return configNum;
    }

    // scan wifi networks and display wifi strength
    __LDBG_printf("scan wifi");
    auto num = WiFi.scanNetworks(false, true);
    __LDBG_printf("num=%u", num);
    if (num > 0) {
        #if DEBUG_KFC_CONFIG
            // display all scanned wifi networks
            for(uint8_t i = 0; i < num; i++) {
                String ssid;
                uint8_t encType = 0;
                int32_t rssi = 0;
                uint8_t *bssid = nullptr;
                int32_t channel = 0;
                bool hidden = false;
                #if ESP8266
                    auto res = WiFi.getNetworkInfo(i, ssid, encType, rssi, bssid, channel, hidden);
                #else
                    auto res = WiFi.getNetworkInfo(i, ssid, encType, rssi, bssid, channel);
                #endif
                if (res) {
                    __DBG_printf("wifi=%s rssi=%d hidden=%d bssid=%s channel=%d enc=%d", ssid.c_str(), rssi, hidden, mac2String(bssid).c_str(), channel, encType);
                }
                else {
                    __DBG_printf("wifi=%d error", i);
                }
            }
            __DBG_printf("---");
        #endif
        for(auto &station: stations) {
            for(uint8_t i = 0; i < num; i++) {
                if (station._SSID.length()) {
                    auto ssid = WiFi.SSID(i);
                    if (ssid.length()) {
                        #if !defined(REAL_DEVICE)
                            // display all scanned wifi networks and mark connected network (green) and configured networks (yellow)
                            auto type = PSTR("");
                            if (ssid == station._SSID) {
                                type = PSTR(_VT100(bold_green));
                            } else {
                                for(const auto &station: stations) {
                                    if (ssid == station._SSID) {
                                        type = PSTR(_VT100(yellow));
                                        break;
                                    }
                                }
                            }
                            __DBG_printf("ssid=%s%s" _VT100(reset) " prio=%d bssid=%s rssi=%d", type, ssid.c_str(), station._priority, mac2String(WiFi.BSSID(i)).c_str(), WiFi.RSSI(i));
                        #endif
                        if (ssid == station._SSID) {
                            if (station._priority == 0) {
                                // use RSSI as priority to connect to the strongest network
                                station._priority = -WiFi.RSSI(i);
                                if (WiFi.BSSID(i)) {
                                    // update BSSID for network
                                    memmove(station._bssid, WiFi.BSSID(i), sizeof(station._bssid));
                                }
                            }
                            break;
                        }
                    }
                }
            }
        }
    }
    __LDBG_printf("scan wifi done");
    return configNum;
}

static KFCConfigurationPlugin plugin;

PROGMEM_DEFINE_PLUGIN_OPTIONS(
    KFCConfigurationPlugin,
    "cfg",              // name
    "cfg",              // friendly name
    // web_templates (class StatusTemplate)
    "index,status",
    // config_forms
    "wifi,network,device,password",
    // reconfigure_dependencies
    "wifi,network",
    PluginComponent::PriorityType::CONFIG,
    PluginComponent::RTCMemoryId::CONFIG,
    static_cast<uint8_t>(PluginComponent::MenuType::NONE),
    true,               // allow_safe_mode
    true,               // setup_after_deep_sleep
    false,              // has_get_status
    true,               // has_config_forms
    false,              // has_web_ui
    true,               // has_web_templates
    false,              // has_at_mode
    0                   // __reserved
);

KFCConfigurationPlugin::KFCConfigurationPlugin() : PluginComponent(PROGMEM_GET_PLUGIN_OPTIONS(KFCConfigurationPlugin))
{
    REGISTER_PLUGIN(this, "KFCConfigurationPlugin");
}

void KFCConfigurationPlugin::setup(SetupModeType mode, const PluginComponents::DependenciesPtr &dependencies)
{
    __LDBG_printf("safe mode %d, wake up %d", (mode == SetupModeType::SAFE_MODE), resetDetector.hasWakeUpDetected());
    config.setup();

    #if NTP_LOG_TIME_UPDATE
        PrintString nowStr;
        nowStr.strftime(FSPGM(strftime_date_time_zone), time(nullptr));
        Logger_notice(F("RTC time: %s"), nowStr.c_str());
    #endif

    #if DEBUG
        if (!resetDetector.hasWakeUpDetected()) {
            // WiFi should not be connected unless coming back from deep sleep
            if (WiFi.isConnected()) {
                __LDBG_print("WiFi up, skipping init");
                Logger_error(F("WiFi already up"));
                BUILTIN_LED_SET(BlinkLEDTimer::BlinkType::SOS);
                return;
            }
        }
    #endif

    #if ENABLE_DEEP_SLEEP
        if (!resetDetector.hasWakeUpDetected())
    #endif
    {
        config.printInfo(Serial);

        if (!config.connectWiFi()) {
            Serial.printf_P(PSTR("Configuring WiFi failed: %s\n"), config.getLastError());
            #if DEBUG
                config.dump(Serial);
            #endif
        }
    }
}

void KFCConfigurationPlugin::reconfigure(const String &source)
{
    if (source == FSPGM(network) || source == FSPGM(wifi)) {
        config.reconfigureWiFi();
    }
}

WebTemplate *KFCConfigurationPlugin::getWebTemplate(const String &name)
{
    return new StatusTemplate();
}
